# PH Employee Database

#### Dependencies

In [61]:
# config 
from config import user_name, password


# Pandas
import pandas as pd

# Matplotlib
import matplotlib.pyplot as plt

# NumPy
import numpy as np


#### Create Engine

In [62]:
# SQL Alchemy
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{user_name}:{password}@localhost:5432/Employees')
connection = engine.connect()

#### The most common salary ranges for employees

In [64]:

salaries_data = pd.read_sql("SELECT * FROM salaries", connection)
salaries_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228